Repository: GigaDuckAI/conduck
Catalog: Conduck/Conduck/Localizable.xcstrings
Source language: en
Languages: es, ja, zh_hans

# fileTransfer.guide.intro.header
source: Agent file transfer
es: Transferencia de archivos del agente
ja: エージェントのファイル転送
zh_hans: 智能体文件传输

# fileTransfer.guide.title
source: File transfer
es: Transferencia de archivos
ja: ファイル転送
zh_hans: 文件传输

# fileTransfer.inline.autoOn
source: Turned on automatically by Quick connect above.
es: Conexión rápida la activa automáticamente arriba.
ja: 上のクイック接続で自動的に有効になります。
zh_hans: 由上方的“快速连接”自动开启。

# fileTransfer.inline.checking
source: Checking…
es: Comprobando…
ja: 確認中…
zh_hans: 正在检查…

# fileTransfer.inline.failed
source: Test failed
es: Falló la prueba
ja: テスト失敗
zh_hans: 测试失败

# fileTransfer.inline.fileServerReady
source: Server test passed
es: Prueba del servidor superada
ja: サーバーテスト成功
zh_hans: 服务器测试通过

# fileTransfer.inline.hideDetails
source: Hide details
es: Ocultar detalles
ja: 詳細を隠す
zh_hans: 隐藏详情

# fileTransfer.inline.listingUnchecked
source: Sending files works. Conduck couldn't check whether files can come back — try the test again.
es: El envío de archivos funciona. Conduck no pudo comprobar si pueden volver archivos: repite la prueba.
ja: ファイルの送信はできますが、Conduckはファイルの返却を確認できませんでした。もう一度テストしてください。
zh_hans: 文件发送正常，但 Conduck 无法确认文件能否返回。请再次测试。

# fileTransfer.inline.manualLink
source: Set up by hand
es: Configurar manualmente
ja: 手動で設定
zh_hans: 手动设置

# fileTransfer.inline.serverLabel
source: Server
es: Servidor
ja: サーバー
zh_hans: 服务器

# fileTransfer.inline.showDetails
source: Show details
es: Mostrar detalles
ja: 詳細を表示
zh_hans: 显示详情

# fileTransfer.inline.test
source: Test
es: Probar
ja: テスト
zh_hans: 测试

# fileTransfer.inline.uploadOnly
source: Sending files works. This server can't list folders, so files the agent creates won't come back on their own — you'll still find them on the server.
es: El envío de archivos funciona. Este servidor no puede listar carpetas, así que los archivos que cree el agente no volverán automáticamente; seguirás encontrándolos en el servidor.
ja: ファイルの送信はできますが、このサーバーはフォルダ一覧を取得できないため、エージェントが作成したファイルは自動で返却されません。サーバー上では確認できます。
zh_hans: 文件发送正常，但此服务器无法列出文件夹，因此智能体创建的文件不会自动返回。你仍可在服务器上找到它们。

# fileTransfer.intro.body
source: Let your agent work on real files — PDFs, spreadsheets, archives. They live on a small file-server next to your agent; Conduck never stores them.
es: Deja que tu agente trabaje con archivos reales: PDF, hojas de cálculo y archivos comprimidos. Están en un pequeño servidor de archivos junto a tu agente; Conduck nunca los almacena.
ja: PDF、スプレッドシート、アーカイブなど、実際のファイルをエージェントで扱えます。ファイルはエージェントの隣にある小さなファイルサーバーに保存され、Conduckは保存しません。
zh_hans: 让智能体处理实际文件，例如 PDF、电子表格和压缩包。文件保存在智能体旁的小型文件服务器上，Conduck 从不存储它们。

# fileTransfer.manual.explanation.custom.v2
source: Manual setup needs an agent with file tools and an HTTPS WebDAV server.
es: La configuración manual necesita un agente con herramientas de archivos y un servidor WebDAV con HTTPS.
ja: 手動設定には、ファイルツールを持つエージェントとHTTPS WebDAVサーバーが必要です。
zh_hans: 手动设置需要具有文件工具的智能体，以及 HTTPS WebDAV 服务器。

# fileTransfer.manual.explanation.managed
source: Quick connect usually handles this. For manual setup, run an HTTPS WebDAV server on your gateway.
es: Conexión rápida suele encargarse de esto. Para configurarlo manualmente, ejecuta un servidor WebDAV con HTTPS en tu pasarela.
ja: 通常はクイック接続で設定できます。手動の場合は、ゲートウェイ上でHTTPS WebDAVサーバーを稼働させてください。
zh_hans: “快速连接”通常会处理此设置。手动设置时，请在网关上运行 HTTPS WebDAV 服务器。

# fileTransfer.manual.mechanism
source: Files are uploaded here so the agent can open them with its tools.
es: Los archivos se suben aquí para que el agente pueda abrirlos con sus herramientas.
ja: ファイルはここにアップロードされ、エージェントがツールで開けるようになります。
zh_hans: 文件上传到这里，智能体才能用工具打开它们。

# fileTransfer.needsSetup.setUp
source: Set Up
es: Configurar
ja: 設定
zh_hans: 设置

# fileTransfer.needsSetup.setUp.a11y
source: Set up file transfer
es: Configurar transferencia de archivos
ja: ファイル転送を設定
zh_hans: 设置文件传输

# fileTransfer.needsSetup.sublabel
source: Needs file transfer
es: Necesita transferencia de archivos
ja: ファイル転送の設定が必要
zh_hans: 需要文件传输

# fileTransfer.needsSetup.tile.a11y
source: File %@ needs file transfer set up
es: El archivo %@ necesita que se configure la transferencia de archivos
ja: ファイル%@にはファイル転送の設定が必要です
zh_hans: 文件 %@ 需要先设置文件传输

# fileTransfer.picker.backend.label
source: Agent style
es: Tipo de agente
ja: エージェントの種類
zh_hans: 智能体类型

# fileTransfer.picker.exposure.cloudflare
source: Cloudflare (Advanced)
es: Cloudflare (avanzado)
ja: Cloudflare（上級者向け）
zh_hans: Cloudflare（高级）

# fileTransfer.picker.exposure.label
source: Expose over HTTPS
es: Hacer accesible mediante HTTPS
ja: HTTPS経由で公開
zh_hans: 通过 HTTPS 开放访问

# fileTransfer.picker.exposure.tailscale
source: Tailscale (Recommended)
es: Tailscale (recomendado)
ja: Tailscale（推奨）
zh_hans: Tailscale（推荐）

# fileTransfer.picker.os.label
source: Server OS
es: Sistema operativo del servidor
ja: サーバーOS
zh_hans: 服务器操作系统

# fileTransfer.pickers.footer
source: These choices only change the setup commands below.
es: Estas opciones solo cambian los comandos de configuración de abajo.
ja: この選択は、下の設定コマンドにのみ反映されます。
zh_hans: 这些选项仅会更改下方的设置命令。

# fileTransfer.preview.accessibility
source: Download and preview file %@
es: Descargar y previsualizar el archivo %@
ja: ファイル%@をダウンロードしてプレビュー
zh_hans: 下载并预览文件 %@

# fileTransfer.preview.failed
source: Couldn't preview the file.
es: No se pudo previsualizar el archivo.
ja: ファイルをプレビューできませんでした。
zh_hans: 无法预览文件。

# fileTransfer.reconfigure.disclosure
source: Reconfigure
es: Reconfigurar
ja: 再設定
zh_hans: 重新配置

# fileTransfer.requirements.caption
source: Conduck can't verify these from this device.
es: Conduck no puede verificar esto desde este dispositivo.
ja: このデバイスからは確認できません。
zh_hans: Conduck 无法从此设备核验这些条件。

# fileTransfer.requirements.header
source: Also required
es: También necesario
ja: 追加の要件
zh_hans: 还需要

# fileTransfer.requirements.reachability.detail
source: Reachable anywhere you use this gateway.
es: Accesible desde cualquier lugar donde uses esta pasarela.
ja: このゲートウェイを使う場所から接続できること。
zh_hans: 在使用此网关的任何地方均可访问。

# fileTransfer.requirements.reachability.title
source: Reachability
es: Accesibilidad de red
ja: 接続の到達性
zh_hans: 可访问性

# fileTransfer.requirements.tools.detail
source: Can read and write files.
es: Puede leer y escribir archivos.
ja: ファイルを読み書きできること。
zh_hans: 可以读写文件。

# fileTransfer.requirements.tools.title
source: Agent tools
es: Herramientas del agente
ja: エージェントのツール
zh_hans: 智能体工具

# fileTransfer.requirements.workspace.generic
source: Serves the agent's working folder.
es: Sirve la carpeta de trabajo del agente.
ja: エージェントの作業フォルダを公開すること。
zh_hans: 提供智能体工作文件夹的文件服务。

# fileTransfer.requirements.workspace.hermes
source: Serves the folder configured as terminal.cwd.
es: Sirve la carpeta configurada como terminal.cwd.
ja: terminal.cwdに設定したフォルダを公開します。
zh_hans: 提供 terminal.cwd 配置的文件夹的文件服务。

# fileTransfer.requirements.workspace.openclaw
source: Serves ~/.openclaw/workspace, unless you changed it.
es: Sirve ~/.openclaw/workspace, salvo que lo hayas cambiado.
ja: 変更していなければ~/.openclaw/workspaceを公開します。
zh_hans: 提供 ~/.openclaw/workspace 的文件服务，除非你更改了此路径。

# fileTransfer.requirements.workspace.title
source: Workspace
es: Espacio de trabajo
ja: ワークスペース
zh_hans: 工作区

# fileTransfer.row.helper
source: Let this gateway's agent open and create files: PDFs, spreadsheets, archives.
es: Permite que el agente de esta pasarela abra y cree archivos: PDF, hojas de cálculo y archivos comprimidos.
ja: このゲートウェイのエージェントで、PDF、スプレッドシート、アーカイブなどのファイルを開いたり作成したりできます。
zh_hans: 让此网关的智能体打开和创建文件，例如 PDF、电子表格和压缩包。

# fileTransfer.row.saveFirst
source: Save the gateway first to set up file transfer.
es: Guarda primero la pasarela para configurar la transferencia de archivos.
ja: ファイル転送を設定するには、まずゲートウェイを保存してください。
zh_hans: 请先保存网关，再设置文件传输。

# fileTransfer.row.subtitle.needsAttention
source: Couldn't write, read, and delete a test file.
es: No se pudo escribir, leer y eliminar un archivo de prueba.
ja: テストファイルの書き込み、読み取り、削除ができませんでした。
zh_hans: 无法写入、读取和删除测试文件。

# fileTransfer.row.subtitle.optional
source: Use this if your gateway has file tools.
es: Usa esto si tu pasarela tiene herramientas de archivos.
ja: ゲートウェイにファイルツールがある場合に使います。
zh_hans: 如果网关具有文件工具，请使用此功能。

# fileTransfer.row.subtitle.ready
source: Agents can open attachments and return files.
es: Los agentes pueden abrir adjuntos y devolver archivos.
ja: エージェントは添付を開き、ファイルを返却できます。
zh_hans: 智能体可以打开附件并返回文件。

# fileTransfer.row.subtitle.recommended
source: Usually turned on automatically by the setup code.
es: El código de configuración suele activarlo automáticamente.
ja: 通常は設定コードで自動的に有効になります。
zh_hans: 通常由设置代码自动开启。

# fileTransfer.row.subtitle.saved
source: Tap to verify the file server.
es: Toca para verificar el servidor de archivos.
ja: タップしてファイルサーバーを確認。
zh_hans: 轻点以验证文件服务器。

# fileTransfer.row.title
source: Files and outputs
es: Archivos y resultados
ja: ファイルと出力
zh_hans: 文件与输出

# fileTransfer.save.failed
source: Couldn't save the file.
es: No se pudo guardar el archivo.
ja: ファイルを保存できませんでした。
zh_hans: 无法保存文件。

# fileTransfer.saveAs
source: Save As…
es: Guardar como…
ja: 別名で保存…
zh_hans: 另存为…

# fileTransfer.saveAs.accessibility
source: Save file %@
es: Guardar archivo %@
ja: ファイル%@を保存
zh_hans: 保存文件 %@

# fileTransfer.sent.onFileServer
source: On your file server
es: En tu servidor de archivos
ja: ファイルサーバー上
zh_hans: 位于文件服务器上

# fileTransfer.sent.sizeOnFileServer
source: %@ · on your file server
es: %@ · en tu servidor de archivos
ja: %@ · ファイルサーバー上
zh_hans: %@ · 位于文件服务器上

# fileTransfer.snippet.copied
source: Copied
es: Copiado
ja: コピーしました
zh_hans: 已复制

# fileTransfer.snippet.copy
source: Copy
es: Copiar
ja: コピー
zh_hans: 复制

# fileTransfer.snippet.copyScript
source: Copy setup script
es: Copiar script de configuración
ja: 設定スクリプトをコピー
zh_hans: 复制设置脚本

# fileTransfer.snippet.footer
source: Run these on the machine where your agent lives. The password is shown only here — keep it secret.
es: Ejecuta estos comandos en la máquina donde está tu agente. La contraseña solo se muestra aquí: mantenla en secreto.
ja: エージェントが稼働しているマシンで実行してください。パスワードはここだけに表示されます。秘密にしてください。
zh_hans: 请在运行智能体的机器上执行这些命令。密码仅在此处显示，请保密。

# fileTransfer.snippet.hidePreview
source: Hide script
es: Ocultar script
ja: スクリプトを隠す
zh_hans: 隐藏脚本

# fileTransfer.snippet.showPreview
source: Show script
es: Mostrar script
ja: スクリプトを表示
zh_hans: 显示脚本

# fileTransfer.softConfirm.attach
source: Attach
es: Adjuntar
ja: 添付
zh_hans: 附加

# fileTransfer.softConfirm.cancel
source: Cancel
es: Cancelar
ja: キャンセル
zh_hans: 取消

# fileTransfer.softConfirm.message
source: %1$@ is %2$@ in size. Large files can take a while to upload.
es: %1$@ tiene un tamaño de %2$@. Los archivos grandes pueden tardar en subirse.
ja: %1$@のサイズは%2$@です。大きいファイルのアップロードには時間がかかることがあります。
zh_hans: %1$@ 的大小为 %2$@，上传大文件可能需要一些时间。

# fileTransfer.softConfirm.title
source: Attach large file?
es: ¿Adjuntar archivo grande?
ja: 大きいファイルを添付しますか？
zh_hans: 附加大文件？

# fileTransfer.status.missing
source: Not set up
es: Sin configurar
ja: 未設定
zh_hans: 未设置

# fileTransfer.status.needsAttention.meaning
source: The last server test failed.
es: Falló la última prueba del servidor.
ja: 前回のサーバーテストは失敗しました。
zh_hans: 上次服务器测试失败。

# fileTransfer.status.needsAttention.short
source: Needs attention
es: Necesita atención
ja: 確認が必要
zh_hans: 需要处理

# fileTransfer.status.needsAttention.title
source: Server test failed
es: Falló la prueba del servidor
ja: サーバーテスト失敗
zh_hans: 服务器测试失败

# fileTransfer.status.needsTest
source: Saved — run the test
es: Guardado: ejecuta la prueba
ja: 保存済み — テストを実行してください
zh_hans: 已保存，请运行测试

# fileTransfer.status.notSet
source: File transfer: Not set up
es: Transferencia de archivos: sin configurar
ja: ファイル転送：未設定
zh_hans: 文件传输：未设置

# fileTransfer.status.notSet.short
source: Not set up
es: Sin configurar
ja: 未設定
zh_hans: 未设置

# fileTransfer.status.optional.meaning
source: Set this up only if you want this gateway to use files.
es: Configura esto solo si quieres que esta pasarela use archivos.
ja: このゲートウェイでファイルを使う場合のみ設定してください。
zh_hans: 仅在希望此网关使用文件时设置。

# fileTransfer.status.optional.short
source: Optional
es: Opcional
ja: 任意
zh_hans: 可选

# fileTransfer.status.optional.title
source: File transfer not set up
es: Transferencia de archivos sin configurar
ja: ファイル転送は未設定です
zh_hans: 文件传输未设置

# fileTransfer.status.ready
source: File transfer: Ready
es: Transferencia de archivos: lista
ja: ファイル転送：準備完了
zh_hans: 文件传输：就绪

# fileTransfer.status.ready.meaning
source: Conduck uploaded and retrieved a test file.
es: Conduck subió y recuperó un archivo de prueba.
ja: Conduckがテストファイルをアップロードし、取得しました。
zh_hans: Conduck 已上传并取回测试文件。

# fileTransfer.status.ready.short
source: Server tested
es: Servidor probado
ja: サーバーはテスト済みです
zh_hans: 服务器已测试

# fileTransfer.status.ready.title
source: File server tested
es: Servidor de archivos probado
ja: ファイルサーバーはテスト済みです
zh_hans: 文件服务器已测试

# fileTransfer.status.recommended.meaning
source: Set up a file server so this agent can work with files.
es: Configura un servidor de archivos para que este agente pueda trabajar con archivos.
ja: このエージェントがファイルを扱うには、ファイルサーバーを設定してください。
zh_hans: 设置文件服务器，让智能体可以处理文件。

# fileTransfer.status.recommended.short
source: Recommended
es: Recomendado
ja: 推奨
zh_hans: 推荐

# fileTransfer.status.recommended.title
source: Set up file transfer
es: Configurar transferencia de archivos
ja: ファイル転送を設定
zh_hans: 设置文件传输

# fileTransfer.status.saved.meaning
source: The address and password are saved. Test the server before sending files.
es: La dirección y la contraseña están guardadas. Prueba el servidor antes de enviar archivos.
ja: アドレスとパスワードは保存されています。ファイルを送る前にサーバーをテストしてください。
zh_hans: 地址和密码已保存，发送文件前请测试服务器。

# fileTransfer.status.saved.short.v2
source: Test required
es: Se necesita una prueba
ja: テストが必要
zh_hans: 需要测试

# fileTransfer.status.saved.title.v2
source: File server test required
es: Se necesita una prueba del servidor de archivos
ja: ファイルサーバーのテストが必要です
zh_hans: 需要测试文件服务器

# fileTransfer.status.tip.a11y
source: About file transfer status
es: Acerca del estado de transferencia de archivos
ja: ファイル転送の状態について
zh_hans: 关于文件传输状态

# fileTransfer.status.uploadOnly.meaning
source: Conduck uploaded a test file and read it back. This server can't list folders, so files the agent creates won't come back on their own — you'll still find them on the server.
es: Conduck subió un archivo de prueba y lo leyó. Este servidor no puede listar carpetas, así que los archivos que cree el agente no volverán automáticamente; seguirás encontrándolos en el servidor.
ja: Conduckがテストファイルをアップロードし、読み取れました。このサーバーはフォルダ一覧を取得できないため、エージェントが作成したファイルは自動で返却されません。サーバー上では確認できます。
zh_hans: Conduck 已上传测试文件并读回。此服务器无法列出文件夹，因此智能体创建的文件不会自动返回，你仍可在服务器上找到它们。

# fileTransfer.status.uploadOnly.title
source: File server tested — uploads only
es: Servidor de archivos probado: solo subidas
ja: ファイルサーバーはテスト済み — アップロードのみ
zh_hans: 文件服务器已测试，仅支持上传

# fileTransfer.status.uploadsOnly.short
source: Uploads only
es: Solo subidas
ja: アップロードのみ
zh_hans: 仅支持上传

# fileTransfer.test.button
source: Run Test
es: Ejecutar prueba
ja: テストを実行
zh_hans: 运行测试

# fileTransfer.test.cta
source: Test Connection
es: Probar conexión
ja: 接続をテスト
zh_hans: 测试连接

# fileTransfer.test.footer
source: Conduck checks it can reach, sign in to, write to, and read from your file server.
es: Conduck comprueba que puede acceder a tu servidor de archivos, iniciar sesión en él, escribir y leer.
ja: Conduckはファイルサーバーへの接続、認証、書き込み、読み取りを確認します。
zh_hans: Conduck 会检查文件服务器能否连接、登录、写入和读取。

# fileTransfer.test.header
source: Test connection
es: Probar conexión
ja: 接続をテスト
zh_hans: 测试连接

# fileTransfer.test.needCredential
source: Generate a server password first.
es: Genera primero una contraseña del servidor.
ja: まずサーバーパスワードを生成してください。
zh_hans: 请先生成服务器密码。

# fileTransfer.test.stage.auth
source: Authentication
es: Autenticación
ja: 認証
zh_hans: 身份验证

# fileTransfer.test.stage.listing
source: List a folder
es: Listar una carpeta
ja: フォルダ一覧を取得
zh_hans: 列出文件夹

# fileTransfer.test.stage.listing.unchecked
source: Sending files works. Conduck couldn't check whether files can come back — try this test again.
es: El envío de archivos funciona. Conduck no pudo comprobar si pueden volver archivos: repite esta prueba.
ja: ファイルの送信はできますが、Conduckはファイルの返却を確認できませんでした。このテストを再実行してください。
zh_hans: 文件发送正常，但 Conduck 无法确认文件能否返回。请再次运行此测试。

# fileTransfer.test.stage.listing.unsupported
source: This server can't list folders. Sending files to the agent works; files the agent creates can't come back on their own.
es: Este servidor no puede listar carpetas. El envío de archivos al agente funciona; los archivos que cree no podrán volver automáticamente.
ja: このサーバーはフォルダ一覧を取得できません。エージェントへのファイル送信はできますが、エージェントが作成したファイルは自動で返却されません。
zh_hans: 此服务器无法列出文件夹。可以向智能体发送文件，但它创建的文件无法自动返回。

# fileTransfer.test.stage.reachability
source: Reachability & TLS
es: Accesibilidad de red y TLS
ja: 接続とTLS
zh_hans: 可访问性与 TLS

# fileTransfer.test.stage.read
source: Read it back
es: Volver a leerlo
ja: 読み取りを確認
zh_hans: 读回文件

# fileTransfer.test.stage.write
source: Write a test file
es: Escribir un archivo de prueba
ja: テストファイルを書き込む
zh_hans: 写入测试文件

# fileTransfer.tip.credential.a11y
source: About Server password
es: Acerca de Contraseña del servidor
ja: サーバーパスワードについて
zh_hans: 关于服务器密码

# fileTransfer.tip.credential.message
source: A password Conduck invents for your file server, so only your devices can put files on it — not anyone who happens to find the address. Conduck signs in as “conduck” with this password, keeps it in the Keychain, and sends it to your file server and nowhere else. Your server has to be told the same password, or it turns the upload away.
es: Una contraseña que Conduck genera para tu servidor de archivos, para que solo tus dispositivos puedan poner archivos en él, en lugar de cualquiera que encuentre la dirección. Conduck inicia sesión como “conduck” con esta contraseña, la guarda en el llavero y la envía únicamente a tu servidor de archivos. Tu servidor debe tener configurada la misma contraseña o rechazará la subida.
ja: ファイルサーバーのアドレスを見つけた他人がファイルを置けないよう、Conduckが生成するパスワードです。Conduckはこのパスワードで「conduck」としてサインインし、キーチェーンに保存します。送信先はファイルサーバーだけです。サーバーにも同じパスワードを設定しないと、アップロードが拒否されます。
zh_hans: 这是 Conduck 为文件服务器生成的密码，确保只有你的设备能上传文件，而非任何知道地址的人。Conduck 使用用户名“conduck”和此密码登录，将密码保存在钥匙串中，且只发送给文件服务器。服务器也必须配置相同密码，否则会拒绝上传。

# fileTransfer.tip.credential.title
source: Server password
es: Contraseña del servidor
ja: サーバーパスワード
zh_hans: 服务器密码

# fileTransfer.tip.fingerprint.a11y
source: About Pinned cert fingerprint
es: Acerca de Huella fijada del certificado
ja: 固定する証明書フィンガープリントについて
zh_hans: 关于固定的证书指纹

# fileTransfer.tip.fingerprint.title
source: Pinned cert fingerprint
es: Huella fijada del certificado
ja: 固定する証明書フィンガープリント
zh_hans: 固定的证书指纹

# fileTransfer.tip.url.a11y
source: About File-server URL
es: Acerca de URL del servidor de archivos
ja: ファイルサーバーURLについて
zh_hans: 关于文件服务器 URL

# fileTransfer.tip.url.message
source: Your gateway carries the conversation, but it has nowhere to put a file. So files go to a second small service you run alongside it — a file server — and your agent picks them up from there. This is that service's address, which is why it's a different address and port from the gateway's. Conduck uploads straight to it; the file passes through no one else.
es: Tu pasarela lleva la conversación, pero no tiene dónde poner un archivo. Por eso los archivos van a otro pequeño servicio que ejecutas junto a ella, un servidor de archivos, y tu agente los recoge allí. Esta es la dirección de ese servicio, por eso usa una dirección y un puerto distintos de los de la pasarela. Conduck sube los archivos directamente; no pasan por nadie más.
ja: ゲートウェイは会話を処理しますが、ファイルの置き場所はありません。ファイルは、ゲートウェイと一緒に運用する別の小さなサービスであるファイルサーバーに送られ、エージェントがそこから取得します。これはそのサービスのアドレスのため、ゲートウェイとはアドレスとポートが異なります。Conduckは直接アップロードし、ファイルはほかのサービスを通りません。
zh_hans: 网关负责对话，但没有存放文件的地方。因此文件会传到你在旁边运行的另一个小型服务——文件服务器，智能体再从那里读取。这是该服务的地址，所以与网关的地址和端口不同。Conduck 直接上传到它，文件不会经过其他人。

# fileTransfer.tip.url.title
source: File-server URL
es: URL del servidor de archivos
ja: ファイルサーバーURL
zh_hans: 文件服务器 URL

# fileTransfer.url.footer
source: Paste the https:// address the tunnel printed when you ran the commands above.
es: Pega la dirección https:// que mostró el túnel al ejecutar los comandos anteriores.
ja: 上のコマンドを実行した際にトンネルが表示したhttps://アドレスを貼り付けてください。
zh_hans: 粘贴运行上述命令后隧道输出的 https:// 地址。

# fileTransfer.url.footer.manual
source: Paste the https:// address your file server is reachable at.
es: Pega la dirección https:// en la que se puede acceder a tu servidor de archivos.
ja: ファイルサーバーに接続できるhttps://アドレスを貼り付けてください。
zh_hans: 粘贴文件服务器可访问的 https:// 地址。

# fileTransfer.url.footer.manual.v2
source: Paste the https:// address your file server is reachable at — its own HTTPS address — a different hostname, port, or path from the gateway's.
es: Pega la dirección https:// de tu servidor de archivos, su propia dirección HTTPS, con un nombre de host, puerto o ruta distintos de los de la pasarela.
ja: ファイルサーバー専用のhttps://アドレスを貼り付けてください。ゲートウェイとはホスト名、ポート、またはパスが異なります。
zh_hans: 粘贴文件服务器可访问的 https:// 地址，即它自己的 HTTPS 地址，主机名、端口或路径与网关不同。

# fileTransfer.url.footer.manual.v3
source: Paste the https:// address your file server is reachable at.
es: Pega la dirección https:// en la que se puede acceder a tu servidor de archivos.
ja: ファイルサーバーに接続できるhttps://アドレスを貼り付けてください。
zh_hans: 粘贴文件服务器可访问的 https:// 地址。

# fileTransfer.url.header
source: File-server URL
es: URL del servidor de archivos
ja: ファイルサーバーURL
zh_hans: 文件服务器 URL

# fileTransfer.url.invalid
source: Enter the full file-server URL including https://.
es: Introduce la URL completa del servidor de archivos, incluido https://.
ja: https://を含む完全なファイルサーバーURLを入力してください。
zh_hans: 请输入包含 https:// 的完整文件服务器 URL。

# fileTransfer.url.noHost
source: That address is missing its host name — it should look like https://files.example.com.
es: Falta el nombre del host en esa dirección: debería ser como https://files.example.com.
ja: アドレスにホスト名がありません。https://files.example.comのように入力してください。
zh_hans: 此地址缺少主机名，格式应类似 https://files.example.com。

# fileTransfer.url.save
source: Save URL
es: Guardar URL
ja: URLを保存
zh_hans: 保存 URL

# fileTransfer.url.saved
source: URL saved
es: URL guardada
ja: URLを保存しました
zh_hans: URL 已保存

# fileTransfer.url.userinfo
source: Don't include a username or password in the URL — Conduck manages the credential for you. Use the address only, and give the generated password to your server.
es: No incluyas un nombre de usuario ni una contraseña en la URL: Conduck gestiona la credencial por ti. Usa solo la dirección y configura la contraseña generada en tu servidor.
ja: URLにユーザー名やパスワードを含めないでください。Conduckが認証情報を管理します。アドレスだけを使い、生成したパスワードをサーバーに設定してください。
zh_hans: URL 中不要包含用户名或密码。Conduck 会管理凭据，只需填写地址，并将生成的密码配置到服务器。

# gateway.commands.cta.paste
source: Scan or paste setup code
es: Escanear o pegar código de configuración
ja: 設定コードをスキャンまたは貼り付け
zh_hans: 扫描或粘贴设置代码

# gateway.commands.cta.paste.mac
source: Paste setup code
es: Pegar código de configuración
ja: 設定コードを貼り付け
zh_hans: 粘贴设置代码

# gateway.commands.handoff.action.here
source: Scan or paste it here to finish.
es: Escanéalo o pégalo aquí para terminar.
ja: ここでスキャンまたは貼り付けて完了します。
zh_hans: 在此扫描或粘贴，即可完成。

# gateway.commands.handoff.action.mac
source: Then paste it to finish.
es: Después pégalo para terminar.
ja: 続いて貼り付けると完了します。
zh_hans: 然后粘贴即可完成。

# gateway.commands.handoff.outcome
source: conduck-connect ends with a QR code and a setup code
es: conduck-connect termina con un código QR y un código de configuración
ja: conduck-connectは最後にQRコードと設定コードを表示します
zh_hans: conduck-connect 最后会显示二维码和设置代码

# gateway.commands.handoff.outcome.mac
source: conduck-connect ends with a setup code
es: conduck-connect termina con un código de configuración
ja: conduck-connectは最後に設定コードを表示します
zh_hans: conduck-connect 最后会显示设置代码

# gateway.commands.intro.paste
source: Run it in a terminal on that server.
es: Ejecútalo en una terminal de ese servidor.
ja: そのサーバーのターミナルで実行してください。
zh_hans: 在该服务器的终端中运行。
